#-----------------------------------------------------------------------------------------------------------------------
"""
Список невалидных email
"""
INVALID_EMAILS = [
    # Отсутствует @
    "userexample.com",
    # Отсутствует домен
    "user@",
    # Множественные @
    "user@@example.com",
    # Пробелы в email
    "user @example.com",
    "user@ example.com",
    # Неправильный формат TLD
    "user@example.123",
    # Отсутствует доменное имя
    "user@.com",
    # Двойная точка
    "user@example..com",
    # Пустая строка
    "",
    # Только пробелы
    "   ",
    # Некорректные символы
    "user@exa<mple.com"
]

#-----------------------------------------------------------------------------------------------------------------------

"""
Список невалидных паролей
"""
INVALID_PASSWORDS = [
    # Слишком короткий пароль (минимум 6 символов)
    "a",
    "abcde",
    # Слишком длинный пароль (максимум 30 символов)
    "a" * 31,
    # Пароль из пробелов
    "   ",
    # Пустая строка
    ""
]
#-----------------------------------------------------------------------------------------------------------------------